[
    {
        "fact": "World War II began on September 1, 1939, when Germany invaded Poland."
    },
    {
        "fact": "The war lasted until September 2, 1945, making it a six-year conflict."
    },
    {
        "fact": "Over 70 million people died during World War II, making it the deadliest conflict in human history."
    },
    {
        "fact": "The Axis Powers consisted of Germany, Italy, and Japan."
    },
    {
        "fact": "The Allied Powers included the United States, the Soviet Union, the United Kingdom, and China."
    },
    {
        "fact": "Adolf Hitler was the leader of Nazi Germany during World War II."
    },
    {
        "fact": "The attack on Pearl Harbor by Japan on December 7, 1941, led the United States to enter the war."
    },
    {
        "fact": "The Holocaust resulted in the systematic murder of six million Jews by the Nazis."
    },
    {
        "fact": "D-Day, the Allied invasion of Normandy, occurred on June 6, 1944."
    },
    {
        "fact": "The atomic bombings of Hiroshima and Nagasaki in August 1945 led to Japan's surrender."
    },
    {
        "fact": "The Battle of Stalingrad (1942–1943) was one of the deadliest battles in history."
    },
    {
        "fact": "The United Nations was established in 1945 after the war to promote international peace."
    },
    {
        "fact": "The Blitz was a German bombing campaign against the United Kingdom in 1940 and 1941."
    },
    {
        "fact": "The Manhattan Project was the code name for the U.S. effort to develop nuclear weapons."
    },
    {
        "fact": "Anne Frank wrote her famous diary while hiding from the Nazis in Amsterdam."
    },
    {
        "fact": "The Battle of Midway in 1942 was a turning point in the Pacific Theater."
    },
    {
        "fact": "Winston Churchill was the Prime Minister of the United Kingdom during most of the war."
    },
    {
        "fact": "The Soviet Union suffered the highest number of casualties during the war."
    },
    {
        "fact": "The Nuremberg Trials prosecuted prominent leaders of Nazi Germany for war crimes."
    },
    {
        "fact": "The Maginot Line was a line of fortifications built by France to deter German invasion."
    },
    {
        "fact": "The Enigma machine was used by Germany to encode military communications."
    },
    {
        "fact": "The Tuskegee Airmen were the first African-American military aviators in the U.S. Armed Forces."
    },
    {
        "fact": "The Battle of the Bulge was the last major German offensive on the Western Front."
    },
    {
        "fact": "The term 'Blitzkrieg' means 'lightning war' and describes Germany's rapid attack strategy."
    },
    {
        "fact": "The Siege of Leningrad lasted for 872 days, causing immense suffering and loss of life."
    },
    {
        "fact": "The Bataan Death March was a forced transfer of American and Filipino prisoners by the Japanese."
    },
    {
        "fact": "The Spitfire was a famous British fighter aircraft used during the Battle of Britain."
    },
    {
        "fact": "The Yalta Conference in 1945 was a meeting between Churchill, Roosevelt, and Stalin."
    },
    {
        "fact": "The German battleship Bismarck was sunk in May 1941 by British forces."
    },
    {
        "fact": "The Warsaw Uprising in 1944 was an attempt by the Polish resistance to liberate Warsaw from German occupation."
    },
    {
        "fact": "The Japanese attack on Pearl Harbor destroyed or damaged 19 U.S. Navy ships."
    },
    {
        "fact": "The term 'VE Day' stands for Victory in Europe Day, celebrated on May 8, 1945."
    },
    {
        "fact": "The term 'VJ Day' stands for Victory over Japan Day, celebrated on August 15, 1945."
    },
    {
        "fact": "The Battle of Kursk in 1943 was the largest tank battle in history."
    },
    {
        "fact": "The Lend-Lease Act allowed the U.S. to supply military aid to Allied nations."
    },
    {
        "fact": "The German invasion of the Soviet Union was code-named Operation Barbarossa."
    },
    {
        "fact": "The Japanese city of Hiroshima was bombed on August 6, 1945."
    },
    {
        "fact": "The Japanese city of Nagasaki was bombed on August 9, 1945."
    },
    {
        "fact": "The Geneva Conventions established rules for the humane treatment of prisoners of war."
    },
    {
        "fact": "The Battle of El Alamein in 1942 marked a turning point in the North African campaign."
    },
    {
        "fact": "The term 'Kamikaze' refers to Japanese suicide pilots who attacked Allied ships."
    },
    {
        "fact": "The Potsdam Declaration outlined the terms of Japan's surrender."
    },
    {
        "fact": "The Battle of Okinawa was the largest amphibious assault in the Pacific Theater."
    },
    {
        "fact": "The German Luftwaffe was the aerial warfare branch of the Wehrmacht."
    },
    {
        "fact": "The Soviet T-34 tank was one of the most effective tanks of the war."
    },
    {
        "fact": "The Battle of Britain was fought entirely in the air."
    },
    {
        "fact": "The term 'Axis' was first used by Benito Mussolini in 1936."
    },
    {
        "fact": "The U.S. dropped over 2 million tons of bombs during the war."
    },
    {
        "fact": "The Battle of Guadalcanal was the first major Allied offensive in the Pacific."
    },
    {
        "fact": "The term 'Holocaust' comes from a Greek word meaning 'sacrifice by fire.'"
    },
    {
        "fact": "The V-2 rocket was the world's first long-range guided ballistic missile."
    },
    {
        "fact": "The Battle of Dunkirk involved the evacuation of over 330,000 Allied troops."
    },
    {
        "fact": "The term 'Gestapo' refers to the Nazi secret police."
    },
    {
        "fact": "The Battle of Iwo Jima was marked by the iconic raising of the U.S. flag on Mount Suribachi."
    },
    {
        "fact": "The Atlantic Charter was a joint declaration by Roosevelt and Churchill outlining post-war goals."
    },
    {
        "fact": "The term 'Third Reich' refers to Nazi Germany under Hitler's rule."
    },
    {
        "fact": "The Battle of Leyte Gulf was the largest naval battle in history."
    },
    {
        "fact": "The term 'Resistance' refers to underground movements against Axis occupation."
    },
    {
        "fact": "The term 'Iron Curtain' was popularized by Winston Churchill to describe the division of Europe."
    },
    {
        "fact": "The Soviet Union's Red Army captured Berlin in May 1945."
    },
    {
        "fact": "The term 'Final Solution' was the Nazi plan to exterminate the Jewish population."
    }
]